% T1-Q5
% author：建筑智能化陈凯（2213041002)
% Time:22/9/21
% Version:V3

%题目：用泰勒展开计算e^x
%效果图：test_e^-25.jpg; Q5.jpg
%子函数：EXP1(x);EXP2(x);EXP3(x);

clc;clear;close all

%%
%(1):若按自然顺序计算，应该采取什么判停标准
%答：为了让计算机不陷入死循环，控制计算时间，设置阈值1e-6，
%低于此的数据直接舍去不再计算




%%
%(2):测试多个x值，与MATLAB的exp(x)作比较求误差
%图1
%提前封装好计算函数EXP2(X);
X=[-20,-15,-10,-5,-1,1,5,10,15,20];
E1(1:1)=1;%E数组存放误差error

for i=1:1:10 
    E1(i)=exp(X(i))-EXP2(X(i));
    subplot(2,2,1);
    plot(X(i),E1(i),'*-r');
    title('e*=exp(X(i))-EXP2(X(i))');
    xlabel('图1-第(2)问');
    hold on;
end
    grid on;
%误差评估：[-20,20]区间的误差是1e-7级别的，还可以接受
%但是如果做延长，延伸到[-50,50]区间误差就已经大到不能接受了




%%
%(3):X<0时，能否得到准确的结果，不能则改进

%图2
%在-60<x<60多次取值，看EXP2修改前效果
X=-60:1:60;
E2(1:1)=1;
for i=1:1:121
    E2(i)=exp(X(i))-EXP2(X(i));
    subplot(2,2,2);
    plot(X(i),E2(i),'.-r','DisplayName','E(i)');
    title('e*=exp(X(i))-EXP2(X(i))');
    xlabel('图2-第(3)问:算法修改前误差');
    hold on;
end
    grid on;

%从图2可以看到，x在50-100上，误差大到e10以上，
%     对函数进行修改：
%     从图像3可以看到，-25<x<0阶段误差结果较好，在x<-25时
%     误差呈指数级别波动，分析原因。打开test1文件查看
%     e^-25的级数展开各项数值:图片'test_e_25.jpg'

%误差分析：
%例如：级数展开的某一项数值为e100级别，在MATLAB中计算精度为16位截断
%当超过16位就无法保证有效数字，那么截断误差为e84的级别
%n项累积下来的截断误差就难以接受了

%考虑避开MATLAB中16位超额截断的设置(目前无法逾越的关键问题)
%算法小的优化：采用MATLAB自带工具包 sym与vpa函数强行提高计算精度
%在此设计思路下，修改算法为EXP3(X)
X=-60:1:60;
E22(1:1)=1;
for i=1:1:121
    E22(i)=exp(X(i))-EXP3(X(i));
    subplot(2,2,3);
    plot(X(i),E22(i),'.-r','DisplayName','E(i)');
    title('e*=exp(X(i))-EXP3(X(i))');
    xlabel('图3-第(3)问:算法修改后误差');
    hold on;
end
    grid on;
%参考图2与图3，误差有了10%的提高，从e10降到了e9
%存在的问题：abs(x)>80时，数值已经大到了MATLAB无法计算：NAN


%%
%(4):在x<0时尝试用分组或重新排列的方式以取得较好的效果


%至于abs(x)>50时后产生的巨大误差，暂时还没有解决思路
%涉及到了MATLAB的计算机制：数据超过16位自动四舍五入截断
%如果不解决这个问题，想做算法优化还是难以实现


    
saveas(1,'Q5.jpg');